{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 132, 132, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_3336", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3336", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3337", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3337", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3338", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3338", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3624", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3624", "inbound_nodes": [[["conv2d_3336", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3625", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3625", "inbound_nodes": [[["conv2d_3337", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3626", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3626", "inbound_nodes": [[["conv2d_3338", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3624", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3624", "inbound_nodes": [[["batch_normalization_3624", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3625", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3625", "inbound_nodes": [[["batch_normalization_3625", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3626", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3626", "inbound_nodes": [[["batch_normalization_3626", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_912", "trainable": true, "dtype": "float32"}, "name": "add_912", "inbound_nodes": [[["activation_3624", 0, 0, {}], ["activation_3625", 0, 0, {}], ["activation_3626", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1059", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1059", "inbound_nodes": [[["input_4", 0, 0, {}], ["add_912", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3339", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3339", "inbound_nodes": [[["concatenate_1059", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3340", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3340", "inbound_nodes": [[["concatenate_1059", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3341", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3341", "inbound_nodes": [[["concatenate_1059", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3627", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3627", "inbound_nodes": [[["conv2d_3339", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3628", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3628", "inbound_nodes": [[["conv2d_3340", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3629", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3629", "inbound_nodes": [[["conv2d_3341", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3627", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3627", "inbound_nodes": [[["batch_normalization_3627", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3628", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3628", "inbound_nodes": [[["batch_normalization_3628", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3629", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3629", "inbound_nodes": [[["batch_normalization_3629", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_913", "trainable": true, "dtype": "float32"}, "name": "add_913", "inbound_nodes": [[["activation_3627", 0, 0, {}], ["activation_3628", 0, 0, {}], ["activation_3629", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1060", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1060", "inbound_nodes": [[["input_4", 0, 0, {}], ["concatenate_1059", 0, 0, {}], ["add_913", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3342", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3342", "inbound_nodes": [[["concatenate_1060", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3630", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3630", "inbound_nodes": [[["conv2d_3342", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3630", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3630", "inbound_nodes": [[["batch_normalization_3630", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_18", "inbound_nodes": [[["activation_3630", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3343", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3343", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3344", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3344", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3345", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3345", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3631", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3631", "inbound_nodes": [[["conv2d_3343", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3632", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3632", "inbound_nodes": [[["conv2d_3344", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3633", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3633", "inbound_nodes": [[["conv2d_3345", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3631", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3631", "inbound_nodes": [[["batch_normalization_3631", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3632", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3632", "inbound_nodes": [[["batch_normalization_3632", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3633", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3633", "inbound_nodes": [[["batch_normalization_3633", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_914", "trainable": true, "dtype": "float32"}, "name": "add_914", "inbound_nodes": [[["activation_3631", 0, 0, {}], ["activation_3632", 0, 0, {}], ["activation_3633", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1061", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1061", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}], ["add_914", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3346", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3346", "inbound_nodes": [[["concatenate_1061", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3347", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3347", "inbound_nodes": [[["concatenate_1061", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3348", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3348", "inbound_nodes": [[["concatenate_1061", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3634", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3634", "inbound_nodes": [[["conv2d_3346", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3635", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3635", "inbound_nodes": [[["conv2d_3347", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3636", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3636", "inbound_nodes": [[["conv2d_3348", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3634", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3634", "inbound_nodes": [[["batch_normalization_3634", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3635", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3635", "inbound_nodes": [[["batch_normalization_3635", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3636", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3636", "inbound_nodes": [[["batch_normalization_3636", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_915", "trainable": true, "dtype": "float32"}, "name": "add_915", "inbound_nodes": [[["activation_3634", 0, 0, {}], ["activation_3635", 0, 0, {}], ["activation_3636", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1062", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1062", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}], ["concatenate_1061", 0, 0, {}], ["add_915", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3349", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3349", "inbound_nodes": [[["concatenate_1062", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3637", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3637", "inbound_nodes": [[["conv2d_3349", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3637", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3637", "inbound_nodes": [[["batch_normalization_3637", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_19", "inbound_nodes": [[["activation_3637", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3350", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3350", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3351", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3351", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3352", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3352", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3638", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3638", "inbound_nodes": [[["conv2d_3350", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3639", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3639", "inbound_nodes": [[["conv2d_3351", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3640", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3640", "inbound_nodes": [[["conv2d_3352", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3638", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3638", "inbound_nodes": [[["batch_normalization_3638", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3639", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3639", "inbound_nodes": [[["batch_normalization_3639", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3640", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3640", "inbound_nodes": [[["batch_normalization_3640", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_916", "trainable": true, "dtype": "float32"}, "name": "add_916", "inbound_nodes": [[["activation_3638", 0, 0, {}], ["activation_3639", 0, 0, {}], ["activation_3640", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1063", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1063", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}], ["add_916", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3353", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3353", "inbound_nodes": [[["concatenate_1063", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3354", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3354", "inbound_nodes": [[["concatenate_1063", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3355", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3355", "inbound_nodes": [[["concatenate_1063", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3641", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3641", "inbound_nodes": [[["conv2d_3353", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3642", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3642", "inbound_nodes": [[["conv2d_3354", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3643", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3643", "inbound_nodes": [[["conv2d_3355", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3641", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3641", "inbound_nodes": [[["batch_normalization_3641", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3642", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3642", "inbound_nodes": [[["batch_normalization_3642", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3643", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3643", "inbound_nodes": [[["batch_normalization_3643", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_917", "trainable": true, "dtype": "float32"}, "name": "add_917", "inbound_nodes": [[["activation_3641", 0, 0, {}], ["activation_3642", 0, 0, {}], ["activation_3643", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1064", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1064", "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}], ["concatenate_1063", 0, 0, {}], ["add_917", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3356", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3356", "inbound_nodes": [[["concatenate_1064", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3644", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3644", "inbound_nodes": [[["conv2d_3356", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3644", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3644", "inbound_nodes": [[["batch_normalization_3644", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_20", "inbound_nodes": [[["activation_3644", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3357", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3357", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3358", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3358", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3359", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3359", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3645", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3645", "inbound_nodes": [[["conv2d_3357", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3646", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3646", "inbound_nodes": [[["conv2d_3358", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3647", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3647", "inbound_nodes": [[["conv2d_3359", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3645", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3645", "inbound_nodes": [[["batch_normalization_3645", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3646", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3646", "inbound_nodes": [[["batch_normalization_3646", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3647", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3647", "inbound_nodes": [[["batch_normalization_3647", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_918", "trainable": true, "dtype": "float32"}, "name": "add_918", "inbound_nodes": [[["activation_3645", 0, 0, {}], ["activation_3646", 0, 0, {}], ["activation_3647", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1065", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1065", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}], ["add_918", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3360", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3360", "inbound_nodes": [[["concatenate_1065", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3361", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3361", "inbound_nodes": [[["concatenate_1065", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3362", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3362", "inbound_nodes": [[["concatenate_1065", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3648", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3648", "inbound_nodes": [[["conv2d_3360", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3649", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3649", "inbound_nodes": [[["conv2d_3361", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3650", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3650", "inbound_nodes": [[["conv2d_3362", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3648", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3648", "inbound_nodes": [[["batch_normalization_3648", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3649", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3649", "inbound_nodes": [[["batch_normalization_3649", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3650", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3650", "inbound_nodes": [[["batch_normalization_3650", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_919", "trainable": true, "dtype": "float32"}, "name": "add_919", "inbound_nodes": [[["activation_3648", 0, 0, {}], ["activation_3649", 0, 0, {}], ["activation_3650", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1066", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1066", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}], ["concatenate_1065", 0, 0, {}], ["add_919", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3363", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3363", "inbound_nodes": [[["concatenate_1066", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3651", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3651", "inbound_nodes": [[["conv2d_3363", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3651", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3651", "inbound_nodes": [[["batch_normalization_3651", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_432", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_432", "inbound_nodes": [[["activation_3651", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3652", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3652", "inbound_nodes": [[["conv2d_transpose_432", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3652", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3652", "inbound_nodes": [[["batch_normalization_3652", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1067", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1067", "inbound_nodes": [[["activation_3644", 0, 0, {}], ["activation_3652", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3364", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3364", "inbound_nodes": [[["concatenate_1067", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3365", "trainable": true, "dtype": "float32", "filters": 21, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3365", "inbound_nodes": [[["concatenate_1067", 0, 0, 