{"class_name": "Functional", "config": {"name": "model_53", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 132, 132, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_61"}, "name": "input_61", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1776", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1776", "inbound_nodes": [[["input_61", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1761", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1761", "inbound_nodes": [[["conv2d_1776", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1761", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1761", "inbound_nodes": [[["batch_normalization_1761", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1777", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1777", "inbound_nodes": [[["activation_1761", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1762", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1762", "inbound_nodes": [[["conv2d_1777", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1762", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1762", "inbound_nodes": [[["batch_normalization_1762", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_144", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_144", "inbound_nodes": [[["activation_1762", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1778", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1778", "inbound_nodes": [[["max_pooling2d_144", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1763", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1763", "inbound_nodes": [[["conv2d_1778", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1763", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1763", "inbound_nodes": [[["batch_normalization_1763", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1779", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1779", "inbound_nodes": [[["activation_1763", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1764", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1764", "inbound_nodes": [[["conv2d_1779", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1764", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1764", "inbound_nodes": [[["batch_normalization_1764", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_145", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_145", "inbound_nodes": [[["activation_1764", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1780", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1780", "inbound_nodes": [[["max_pooling2d_145", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1765", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1765", "inbound_nodes": [[["conv2d_1780", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1765", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1765", "inbound_nodes": [[["batch_normalization_1765", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1781", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1781", "inbound_nodes": [[["activation_1765", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1766", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1766", "inbound_nodes": [[["conv2d_1781", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1766", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1766", "inbound_nodes": [[["batch_normalization_1766", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_146", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_146", "inbound_nodes": [[["activation_1766", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1782", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1782", "inbound_nodes": [[["max_pooling2d_146", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1767", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1767", "inbound_nodes": [[["conv2d_1782", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1767", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1767", "inbound_nodes": [[["batch_normalization_1767", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1783", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1783", "inbound_nodes": [[["activation_1767", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1768", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1768", "inbound_nodes": [[["conv2d_1783", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1768", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1768", "inbound_nodes": [[["batch_normalization_1768", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_170", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_170", "inbound_nodes": [[["activation_1768", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1769", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1769", "inbound_nodes": [[["conv2d_transpose_170", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1769", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1769", "inbound_nodes": [[["batch_normalization_1769", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_576", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_576", "inbound_nodes": [[["activation_1766", 0, 0, {}], ["activation_1769", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1784", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1784", "inbound_nodes": [[["concatenate_576", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1770", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1770", "inbound_nodes": [[["conv2d_1784", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1770", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1770", "inbound_nodes": [[["batch_normalization_1770", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1785", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1785", "inbound_nodes": [[["activation_1770", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1771", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1771", "inbound_nodes": [[["conv2d_1785", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1771", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1771", "inbound_nodes": [[["batch_normalization_1771", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_171", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_171", "inbound_nodes": [[["activation_1771", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1772", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1772", "inbound_nodes": [[["conv2d_transpose_171", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1772", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1772", "inbound_nodes": [[["batch_normalization_1772", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_577", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_577", "inbound_nodes": [[["activation_1764", 0, 0, {}], ["activation_1772", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1786", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1786", "inbound_nodes": [[["concatenate_577", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1773", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1773", "inbound_nodes": [[["conv2d_1786", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1773", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1773", "inbound_nodes": [[["batch_normalization_1773", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1787", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1787", "inbound_nodes": [[["activation_1773", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1774", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1774", "inbound_nodes": [[["conv2d_1787", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1774", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1774", "inbound_nodes": [[["batch_normalization_1774", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_172", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_172", "inbound_nodes": [[["activation_1774", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1775", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1775", "inbound_nodes": [[["conv2d_transpose_172", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1775", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1775", "inbound_nodes": [[["batch_normalization_1775", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_578", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_578", "inbound_nodes": [[["activation_1762", 0, 0, {}], ["activation_1775", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1788", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1788", "inbound_nodes": [[["concatenate_578", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1776", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1776", "inbound_nodes": [[["conv2d_1788", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1776", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1776", "inbound_nodes": [[["batch_normalization_1776", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1789", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [6, 6], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1789", "inbound_nodes": [[["activation_1776", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1777", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1777", "inbound_nodes": [[["conv2d_1789", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1777", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1777", "inbound_nodes": [[["batch_normalization_1777", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1790", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1790", "inbound_nodes": [[["activation_1777", 0, 0, {}]]]}], "input_layers": [["input_61", 0, 0]], "output_layers": [["conv2d_1790", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}